##### import pandas as pd

In [76]:
import pandas as pd

In [77]:
# 2 main data types
series = pd.Series(["BMW", "TOYOTA", "HONDA"])

In [78]:
# series = 1-dimensional

In [79]:
Colours = pd.Series(["white", "blue", "red"])

In [80]:
Colours

0    white
1     blue
2      red
dtype: object

# DataFrame = 2-dimensional

In [81]:
# DataFrame = 2-dimensional
car_data = pd.DataFrame({"Car make": series, "Colour": Colours})
car_data

  Car make Colour
0      BMW  white
1   TOYOTA   blue
2    HONDA    red

In [82]:
import pandas as pd

In [83]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [84]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [85]:
# Exporting a DataFrame
car_sales.to_csv("exported-car-sales.csv")

In [86]:
import pandas as pd

In [87]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors        Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [88]:
# Attribute
car_sales.dtypes

# Function
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [89]:
car_columns = car_sales.columns

In [90]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [91]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [92]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [93]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [94]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [95]:
mean_values = car_sales.mean(numeric_only=True)
print(mean_values)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [96]:
car_prices = pd.Series([3000,1500, 111250])

In [97]:
car_prices.mean

<bound method Series.mean of 0      3000
1      1500
2    111250
dtype: int64>

In [98]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00 $5,000.00 $7,000.00 $22,000.00 $3,50...
dtype: object

In [99]:
total_doors = car_sales["Doors"].sum()
print(total_doors)

40

In [100]:
len(car_sales)

10

In [101]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## viewing and sellecting data

In [102]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [103]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [104]:
car_sales.tail(4)

     Make Colour  Odometer (KM)  Doors       Price
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [105]:
##loc and iloc
animals = pd.Series(["cat", "dog", "hen", "bird", "rabbit"], index=[1, 3, 5, 6,5])

In [106]:
animals

1       cat
3       dog
5       hen
6      bird
5    rabbit
dtype: object

In [107]:
#loc refers to index
animals.loc[3]

'dog'

In [108]:
animals.loc[:3]

1    cat
3    dog
dtype: object

In [109]:
car_sales.loc[3]

Make                     BMW
Colour                 Black
Odometer (KM)          11179
Doors                      5
Price            $22,000.00
Name: 3, dtype: object

In [110]:
#iloc refers to position starting from 0
animals.iloc[3]

'bird'

In [111]:
car_sales.iloc[4]

Make                 Nissan
Colour                White
Odometer (KM)        213095
Doors                     4
Price            $3,500.00
Name: 4, dtype: object

In [112]:
#iloc[:4} refers to list with 1 till 4
animals.iloc[:4]

1     cat
3     dog
5     hen
6    bird
dtype: object

In [113]:
#loc[:3] refers to 1 to the index 3 but no index 2 for this
animals.loc[:3]

1    cat
3    dog
dtype: object

In [114]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [115]:
car_sales['Make']

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [117]:
car_sales[car_sales['Make'] == 'Toyota']

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [119]:
car_sales[car_sales['Odometer (KM)'] > 100000]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [120]:
pd.crosstab(car_sales['Make'], ['Doors'])

col_0   Doors
Make
BMW         1
Honda       3
Nissan      2
Toyota      4

In [146]:
#Groupby
car_sales.groupby(["Make"]).mean()

TypeError: agg function failed [how->mean,dtype->object]

In [175]:
#run this code if your plot arn't showing up
%matplotlib inline
import matplotlib.pyplot as plt

In [176]:
car_sales['Odometer (KM)'].plot()

In [177]:
car_sales['Odometer (KM)'].hist()

In [181]:
car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]', '').astype(int)

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
C:\Users\USER\AppData\Local\Temp\ipykernel_8476\2312081839.py:1: SyntaxWarning: invalid escape sequence '\$'
  car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]', '').astype(int)

ValueError: invalid literal for int() with base 10: '$4,000.00 '